In [52]:
pip install pymysql

Requirement already satisfied: pymysql in /opt/anaconda3/lib/python3.8/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [53]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import getpass
password = getpass.getpass()

········

In [54]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

### Check the number of rentals for each customer for May

In [55]:
query1 = pd.read_sql_query(
'''
SELECT customer_id, COUNT(rental_id)
FROM rentals_may
GROUP BY customer_id;
''', con = engine
)

may_customers = pd.DataFrame(query1)
display(may_customers.head())

   customer_id  COUNT(rental_id)
0          130                 2
1          459                 1
2          408                 3
3          333                 1
4          222                 5

### Check the number of rentals for each customer for June

In [56]:
query2 = pd.read_sql_query(
'''
SELECT customer_id, COUNT(rental_id)
FROM rentals_june
GROUP BY customer_id;
''', con = engine
)

june_customers = pd.DataFrame(query2)
display(june_customers.head())

   customer_id  COUNT(rental_id)
0          416                 5
1          516                 6
2          239                 5
3          285                 3
4          310                 6

### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.


Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [57]:
rental = pd.merge(may_customers, june_customers, on='customer_id')
rental.columns = ['customer_id', 'may_rental', 'june_rental']
display(rental.head())

   customer_id  may_rental  june_rental
0          130           2            6
1          459           1            7
2          408           3            3
3          333           1            4
4          222           5            2

In [64]:
def check_rental_diff(df):
    df['diff'] = np.where((df['june_rental'] - df['may_rental']) > 0, 'more', 'less')
    return df

display(check_rental_diff(rental).head())

   customer_id  may_rental  june_rental  diff
0          130           2            6  more
1          459           1            7  more
2          408           3            3  less
3          333           1            4  more
4          222           5            2  less